Sekiro22/-STM32F103C8T6-/软件工程/System/OLED.c
#include "stm32f10x.h"
#include "OLED.h"
#include "Delay.h"

#if	IS_HUAWEI == 0
/**
  * @brief  初始化 OLED 使用的硬件 I2C2，将 PB10/PB11 配置为复用开漏并配置 I2C2 为 400kHz 主机模式。
  * @param  无输入参数；函数固定配置 GPIOB、PB10、PB11 和 I2C2，不接收外部配置对象。
  * @return 无返回值。
  */
void HW_I2C_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);
	
	GPIO_InitTypeDef GPIO_Initstructure;
	GPIO_Initstructure.GPIO_Mode = GPIO_Mode_AF_OD;
	GPIO_Initstructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_Initstructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_Initstructure);
	
	I2C_InitTypeDef I2C_InitStructure;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructure.I2C_ClockSpeed = 400000;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_OwnAddress1 = 0x10;
	I2C_Init(I2C2, &I2C_InitStructure);
}

/**
  * @brief  处理 U8g2 硬件 I2C 模式下的 GPIO 与延时回调消息，当前主要响应毫秒延时和默认 GPIO 结果。
  * @param  u8x8 输入/输出参数；U8g2 底层上下文指针，由 U8g2 调用传入，不允许为空。
  * @param  msg 输入参数；U8g2 回调消息类型，不是指针不允许为空，取值必须为 U8X8_MSG_* 枚举之一。
  * @param  arg_int 输入参数；消息附带的整数参数，含义由 msg 决定，不是指针不允许为空。
  * @param  arg_ptr 输入/输出参数；消息附带的数据指针，当前实现未解引用，可为空。
  * @return 固定返回 1，表示消息已按当前适配层能力处理或以默认成功方式响应；当前实现没有失败错误码。
  */
uint8_t u8x8_gpio_and_delay_hw(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr) {
    switch (msg) {
        case U8X8_MSG_DELAY_100NANO: // delay arg_int * 100 nano seconds
            break;
        case U8X8_MSG_DELAY_10MICRO: // delay arg_int * 10 micro seconds
            break;
        case U8X8_MSG_DELAY_MILLI: // delay arg_int * 1 milli second
            Delay_ms(1);
            break;
        case U8X8_MSG_DELAY_I2C: // arg_int is the I2C speed in 100KHz, e.g. 4 = 400 KHz
            break;                    // arg_int=1: delay by 5us, arg_int = 4: delay by 1.25us
        case U8X8_MSG_GPIO_I2C_CLOCK: // arg_int=0: Output low at I2C clock pin
            break;                    // arg_int=1: Input dir with pullup high for I2C clock pin
        case U8X8_MSG_GPIO_I2C_DATA:  // arg_int=0: Output low at I2C data pin
            break;                    // arg_int=1: Input dir with pullup high for I2C data pin
        case U8X8_MSG_GPIO_MENU_SELECT:
            u8x8_SetGPIOResult(u8x8, /* get menu select pin state */ 0);
            break;
        case U8X8_MSG_GPIO_MENU_NEXT:
            u8x8_SetGPIOResult(u8x8, /* get menu next pin state */ 0);
            break;
        case U8X8_MSG_GPIO_MENU_PREV:
            u8x8_SetGPIOResult(u8x8, /* get menu prev pin state */ 0);
            break;
        case U8X8_MSG_GPIO_MENU_HOME:
            u8x8_SetGPIOResult(u8x8, /* get menu home pin state */ 0);
            break;
        default:
            u8x8_SetGPIOResult(u8x8, 1); // default return value
            break;
    }
    return 1;
}

/**
  * @brief  处理 U8g2 硬件 I2C 字节传输回调，完成 I2C 初始化、起始条件、地址发送、数据发送和停止条件。
  * @param  u8x8 输入/输出参数；U8g2 底层上下文指针，当前实现未直接使用但由 U8g2 保证传入，不允许为空。
  * @param  msg 输入参数；U8g2 字节回调消息类型，不是指针不允许为空，必须为 U8X8_MSG_BYTE_* 相关取值。
  * @param  arg_int 输入参数；当 msg 为 U8X8_MSG_BYTE_SEND 时表示待发送字节数，不是指针不允许为空。
  * @param  arg_ptr 输入参数；当 msg 为 U8X8_MSG_BYTE_SEND 时指向待发送数据缓冲区，发送数据时不允许为空，其他消息可为空。
  * @return 返回 1 表示当前消息处理成功，返回 0 表示遇到未支持的消息类型。
  */
uint8_t u8x8_byte_hw_i2c(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr) {
    uint8_t* data = (uint8_t*) arg_ptr;
    switch(msg) {
        case U8X8_MSG_BYTE_SEND:
            while( arg_int-- > 0 ) {
                I2C_SendData(I2C2, *data++);
                while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED)) 
                    continue;
            }
            break;
        case U8X8_MSG_BYTE_INIT:
        /* add your custom code to init i2c subsystem */
            HW_I2C_Init();		
            break;
        case U8X8_MSG_BYTE_SET_DC:
        /* ignored for i2c */
            break;
        case U8X8_MSG_BYTE_START_TRANSFER:
            while(I2C_GetFlagStatus(I2C2, I2C_FLAG_BUSY));
            I2C_GenerateSTART(I2C2, ENABLE);
            while(!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))
                continue;
            I2C_Send7bitAddress(I2C2, 0x78, I2C_Direction_Transmitter);
            while(!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
                continue;
            break;
        case U8X8_MSG_BYTE_END_TRANSFER:
            I2C_GenerateSTOP(I2C2, ENABLE);
            break;
        default:
            return 0;
    }
    return 1;
}

/**
  * @brief  使用 SH1106 128x64 I2C 驱动配置 U8g2 上下文，初始化显示器、退出省电模式并清空绘图缓冲区。
  * @param  u8g2 输入/输出参数；指向待初始化的 U8g2 显示对象，不允许为空，调用者需保证对象生命周期覆盖后续显示过程。
  * @return 无返回值。
  */
void u8g2_Init(u8g2_t *u8g2)
{
	u8g2_Setup_sh1106_i2c_128x64_noname_f(u8g2, U8G2_R0, u8x8_byte_hw_i2c, u8x8_gpio_and_delay_hw);
	u8g2_InitDisplay(u8g2);
	u8g2_SetPowerSave(u8g2, 0);
	u8g2_ClearBuffer(u8g2);
}
#else
/**
  * @brief  设置软件 I2C 的 OLED SCL 引脚电平。
  * @param  BitValue 输入参数；0 表示拉低 PB10，非 0 表示释放/置高 PB10，不是指针不允许为空。
  * @return 无返回值。
  */
void OLED_W_SCL(uint8_t BitValue)
{
	/*根据BitValue的值，将SCL置高电平或者低电平*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
	
	/*如果单片机速度过快，可在此添加适量延时，以避免超出I2C通信的最大速度*/
	//...
}

/**
  * @brief  设置软件 I2C 的 OLED SDA 引脚电平。
  * @param  BitValue 输入参数；0 表示拉低 PB11，非 0 表示释放/置高 PB11，不是指针不允许为空。
  * @return 无返回值。
  */
void OLED_W_SDA(uint8_t BitValue)
{
	/*根据BitValue的值，将SDA置高电平或者低电平*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
	
	/*如果单片机速度过快，可在此添加适量延时，以避免超出I2C通信的最大速度*/
	//...
}

/**
  * @brief  初始化 OLED 软件 I2C 引脚，将 PB10/PB11 配置为开漏输出并释放总线为高电平。
  * @param  无输入参数；函数固定配置 GPIOB、PB10 和 PB11，不接收外部配置对象。
  * @return 无返回值。
  */
void SW_I2C_Init(void)
{
//	uint32_t i, j;
	
	/*在初始化前，加入适量延时，待OLED供电稳定*/
//	for (i = 0; i < 1000; i ++)
//	{
//		for (j = 0; j < 1000; j ++);
//	}
	
	/*将SCL和SDA引脚初始化为开漏模式*/
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	/*释放SCL和SDA*/
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/**
  * @brief  处理 U8g2 软件 I2C 模式下的 GPIO 与延时回调消息，包括初始化、毫秒延时、I2C 延时以及 SCL/SDA 电平控制。
  * @param  u8x8 输入/输出参数；U8g2 底层上下文指针，由 U8g2 调用传入，不允许为空。
  * @param  msg 输入参数；U8g2 回调消息类型，不是指针不允许为空，取值必须为 U8X8_MSG_* 枚举之一。
  * @param  arg_int 输入参数；消息附带整数，GPIO 消息中表示目标电平，延时消息中表示延时时间，不是指针不允许为空。
  * @param  arg_ptr 输入/输出参数；当前实现未解引用，可为空。
  * @return 固定返回 1，表示消息已按当前适配层能力处理或以默认成功方式响应；当前实现没有失败错误码。
  */
uint8_t u8x8_gpio_and_delay(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
  switch(msg)
  {
    case U8X8_MSG_GPIO_AND_DELAY_INIT:
      /* only support for software I2C*/
    
		SW_I2C_Init();
        
      break;
    case U8X8_MSG_DELAY_NANO:
      /* not required for SW I2C */
      break;
    
    case U8X8_MSG_DELAY_10MICRO:
      /* not used at the moment */
      break;
    
    case U8X8_MSG_DELAY_100NANO:
      /* not used at the moment */
      break;
   
    case U8X8_MSG_DELAY_MILLI:
      Delay_ms(arg_int-1);
      break;
    case U8X8_MSG_DELAY_I2C:
      /* arg_int is 1 or 4: 100KHz (5us) or 400KHz (1.25us) */
      Delay_us(arg_int<=2?5:1);
      break;
    
    case U8X8_MSG_GPIO_I2C_CLOCK:
      
      OLED_W_SCL(arg_int);
      break;
    case U8X8_MSG_GPIO_I2C_DATA:
      
      OLED_W_SDA(arg_int);
      break;
/*
    case U8X8_MSG_GPIO_MENU_SELECT:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_SELECT_PORT, KEY_SELECT_PIN));
      break;
    case U8X8_MSG_GPIO_MENU_NEXT:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_NEXT_PORT, KEY_NEXT_PIN));
      break;
    case U8X8_MSG_GPIO_MENU_PREV:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_PREV_PORT, KEY_PREV_PIN));
      break;
    
    case U8X8_MSG_GPIO_MENU_HOME:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_HOME_PORT, KEY_HOME_PIN));
      break;
*/
    default:
      u8x8_SetGPIOResult(u8x8, 1);
      break;
  }
  return 1;
}

/**
  * @brief  使用 SSD1306 128x64 软件 I2C 驱动配置 U8g2 上下文，初始化显示器、退出省电模式并清空绘图缓冲区。
  * @param  u8g2 输入/输出参数；指向待初始化的 U8g2 显示对象，不允许为空，调用者需保证对象生命周期覆盖后续显示过程。
  * @return 无返回值。
  */
void u8g2_Init(u8g2_t *u8g2)
{
	u8g2_Setup_ssd1306_i2c_128x64_noname_f(u8g2, U8G2_R0, u8x8_byte_sw_i2c, u8x8_gpio_and_delay);  // 初始化 u8g2 结构体
	u8g2_InitDisplay(u8g2); // 根据所选的芯片进行初始化工作，初始化完成后，显示器处于关闭状态
	u8g2_SetPowerSave(u8g2, 0); // 打开显示器
	u8g2_ClearBuffer(u8g2);
}
#endif
